/*
1. 요구사항 확인하기
2. 요구사항 바탕으로 인풋 생각하기
3. 인풋 바탕으로 단계별 한글로 함수 설계하기
4. 단계별 구글링 키워드 생각하기
*/

/*
1번 문제 설계

1. 요구사항 확인하기
(1) 페이지가 로딩 되면 기존에 있던 글이 아닌 다른글로 바뀐다.

2. 요구사항 바탕으로 인풋 생각하기
(1) 해당 텍스트 폼을 가져와야한다.

3. 인풋 바탕으로 단계별 한글로 함수 설계하기
(1) 텍스트 폼을 가져온다.
(2) 가져온 텍스트 폼의 텍스트를 바꿔준다.
(3) 로딩 시 바꿔주는 기능으로 출력 

4. 단계별 구글링 키워드 생각하기
(1) 텍스트 폼을 가져와야 한다. - 태그 요소 가져오기 
(2) 불러온 텍스트를 변경 한다. - 태그 요소 변경하기
(3) 로딩 되면 바뀌어야 한다. -  페이지 로드 후 이벤트

=========================================

2번 문제 설계

1. 요구사항 확인하기
(1) 탭 선택시 해당 탭의 배경과 글자 색이 변경
(2) 다른 탭 클릭시 앞서 클릭한 탭은 원래 배경색으로 돌아감  
2. 요구사항 바탕으로 인풋 생각하기
(1) 탭의 태그 요소가 필요하다. 
3. 인풋 바탕으로 단계별 한글로 함수 설계하기
4. 단계별 구글링 키워드 생각하기
*/
